#include <stdio.h>
//------------------------------------------------------------------------------------------------
void swap(int* a, int* b);                          //прототип функции обмена
//------------------------------------------------------------------------------------------------
int main(){
    int m[8] = {0, 1, 1, 0, 1, 0, 1, 0};            //задаем массив саморучно
    int lenght = sizeof(m)/ sizeof(m[0]);           //длина массива
    int right = lenght -1;                          //правый указатель
    int left = 0;                                   //левый указатель

    while (left<=right){
        /* Если левая часть больше правой, меняем*/
        if (m[left] > m[right]){
            swap(&m[left], &m[right]);
            right -= 1;
            left += 1;
        }
        /*Если лево = 0, двиагем указатель вправо */
        if (m[left] == 0){
            left += 1;
        }
        /*Если право = 1, двиагем указатель влево */
        if (m[right] == 1){
            right -= 1;
        }

    }
/*Печатаем результат*/
    for (int k = 0; k < 8; k++){
        printf("%d", m[k]);
    }

    return 0;
}
//------------------------------------------------------------------------------------------------
void swap(int* a, int* b){                             //функция обмена
    int t = 0;

    t = *a;
    *a = *b;
    *b = t;
}
