#include <stdio.h>
#include <cstdlib>
//-----------------------------------------------------------------------------------------------
int merge_s(int* m1, int* m2, int* m3);               //прототип функции слияния
//-----------------------------------------------------------------------------------------------
int m1[4] = {3, 8, 10, 11};
int m2[3] = {1, 7, 9};
int m3[7] = {0};
//-----------------------------------------------------------------------------------------------
int main(){

    merge_s(m1, m2, m3);                              //вызов функции слияния

    return 0;
}
//-----------------------------------------------------------------------------------------------
int merge_s(int* m1, int* m2, int* m3){               //функция слияния

    int i = 0, j = 0;
    int k = 0;

/*Пока есть элементы в m1 и в m2 вместе*/
    while (i < 4 && j < 3){

        if (m1[i] > m2[j]){                          //сравниваем числа из двух массивов, 
            m3[k] = m2[j];
            j += 1;
        }

        else{
            m3[k] = m1[i];                          //
            i += 1;
        }

        k += 1;

    }
/*Добавляем оставшиеся элементы из m1*/
    while (i < 4){
        m3[k] = m1[i];
        i += 1;
        k += 1;
    }
/*Добавляем оставшиеся элементы из m2*/
    while (j < 3){
        m3[k] = m2[j];
        j += 1;
        k += 1;
    }
/*Печатаем результат*/
    for (int m = 0; m < 7; m++){
        printf("%d ", m3[m]);
    }

    return 0;
}
