#include <stdio.h>
//-----------------------------------------------------------------------------------------------
void swap(int* a, int* b);                   //прототип функции обмена
//-----------------------------------------------------------------------------------------------
int main(){
    int m[7]={3, 2, 4, 1, 11, 8, 9};         //вручную задаем неотсортированный массив
    int evenindex = 0;                       //двигается, когда встречаем четное число
    int lenght = sizeof(m)/sizeof(m[0]);     //длина массива
/* Ищем четные числа и переносим в начало*/
    for (int i = 0; i < lenght; i++){

        if (m[i] % 2 == 0){
            swap(&m[i], &m[evenindex]);     //обмен
            evenindex += 1;
        }

    }
/* Печатаем результат */
    for (int k = 0; k < lenght; k++){
        printf("%d ", m[k]);
    }

    return 0;
}
//-----------------------------------------------------------------------------------------------
void swap(int* a, int* b){                     //функция обмена
    int t = 0;

    t = *a;
    *a = *b;
    *b = t;
}
