#include <stdio.h>
//------------------------------------------------------------------------------------------------
void swap(int* a, int* b);                            //прототип функции обмена
//------------------------------------------------------------------------------------------------
int main(){
    int massive[11] = {1, 3, 5, 7, 9, 12, 14, 46, 4, 31, 100}; //саморучно задаем массив
    int left = 0;                                              //левый указатель
    int lenght = sizeof(massive) / sizeof(massive[0]);         //длина массива
    int right = lenght - 1;                                    //правый указатель
/*Печатаем исходный массив*/
    printf("Before: ");
    for (int k = 0; k < 11; k++){
    printf("%d ", massive[k]);
    }

    printf("\n");
/*Переворачиваем*/
    while (left < right){

    swap(&massive[left], &massive[right]);

    left += 1;
    right -= 1;

    }
/*Печатаем массив после обработки*/
    printf("After: ");
    for (int j = 0; j < 11; j++){
    printf("%d ", massive[j]);
    }

    return 0;
}
//--------------------------------------------------------------------------------------------------
void swap(int* a, int* b){                            //функция обмена
    int t = 0;

    t = *a;
    *a = *b;
    *b = t;
}
